app/views/auctioneers/index.html.erb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 27  ORDER BY `users`.`id` ASC LIMIT 1
---
    <% @auctioneers.each do |auctioneer| %>
      <% fullname = auctioneer.user.first_name + ' ' + auctioneer.user.last_name%>