app/views/user_mailer/won_item.html.erb

SELECT  `bids`.* FROM `bids`  WHERE `bids`.`item_id` = 1  ORDER BY amount DESC LIMIT 1
SELECT MAX(`bids`.`amount`) AS max_id FROM `bids`  WHERE `bids`.`user_id` = 1
SELECT COUNT(*) FROM `bids`  WHERE `bids`.`item_id` = 1
---
      <% @wonitems.each do |w| %>
        <%= w.title %> <%= w.description %> <%= w.bids.maximum(:amount) %><br>
        <% total += w.bids.maximum(:amount) %>