app/views/bids/_newbuyitnow.html.erb


      <ul>
      <% @bid.errors.full_messages.each do |message| %>
        <li><%= message %></li>
      <% end %>
      </ul>
    </div>
  <% end %>
  <div class="field">
    <%= f.hidden_field :item_id, :value => @bid.item.id %>
    <%= f.label :amount, "Buy it now price is: " %>
    <%= number_to_currency(@bid.item.start_bid)  %><br>
  </div>
  <div class="field">
    <%= f.label :qty, "Quantity to purchase (cost each: " %><%= number_to_currency(@bid.item.start_bid) %>)<br>
---
SELECT  `items`.* FROM `items`  WHERE `items`.`id` = 11 LIMIT 1