app/views/bids/_newbid.html.erb

SELECT  `items`.* FROM `items`  WHERE `items`.`id` = 12 LIMIT 1
SELECT MAX(`bids`.`amount`) AS max_id FROM `bids`  WHERE `bids`.`item_id` = 1
SELECT `bids`.* FROM `bids`  WHERE `bids`.`item_id` = 12
---
  <div class="field">
    High bid is : <%= number_to_currency(@bid.item.bids.maximum(:amount)) || number_to_currency(0)%>