app/views/auctions/auction_items.html.erb

SELECT  `bids`.* FROM `bids`  WHERE `bids`.`item_id` = 7  ORDER BY `bids`.`id` DESC LIMIT 1
SELECT MAX(`bids`.`amount`) AS max_id FROM `bids`  WHERE `bids`.`item_id` = 7
---
        <td><%= item.bid_increment %></td>
        <td><%= item.bids.maximum(:amount) %></td>