app/views/auctions/finalize.html.erb

  <strong>Auctioneers:</strong>
  <% @auction.auctioneers.each do |auctioneer| %>
  <% fullname = auctioneer.user.first_name + ' ' + auctioneer.user.last_name%>
---
SELECT `auctioneers`.* FROM `auctioneers`  WHERE `auctioneers`.`auction_id` = 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1