app/views/auctions/index.html.erb

SELECT `auctioneers`.* FROM `auctioneers`  WHERE `auctioneers`.`auction_id` = 1
SELECT `auctions`.* FROM `auctions`
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
        <td>
        <% auction.auctioneers.each do |auctioneer| %>
        <% fullname = auctioneer.user.first_name + ' ' + auctioneer.user.last_name%>