app/controllers/auctions_controller.rb

SELECT `auctions`.* FROM `auctions`
SELECT `auctions`.* FROM `auctions`  WHERE `auctions`.`display` = 1 AND `auctions`.`running?` = 1
---
  def index
    if user_signed_in?
      @owner = owner
    end
    if (current_user.is_admin || current_user.is_auctioneer)
      @auctions = Auction.all
    else
      @auctions = Auction.where(display: true)

SELECT  `auctions`.* FROM `auctions`  WHERE `auctions`.`id` = 1 LIMIT 1
UPDATE `auctions` SET `display` = 0, `updated_at` = '2014-11-17 14:13:07' WHERE `auctions`.`id` = 2
SELECT `items`.* FROM `items`  WHERE `items`.`auction_id` = 1
---
  def finalize
    @auction = Auction.find(params[:id])
    respond_to do |format|
    @auction.display = false
      if @auction.save
        items = Item.where(auction_id: @auction.id)

SELECT  `auctions`.* FROM `auctions`  WHERE `auctions`.`id` = 1 LIMIT 1
SELECT `items`.* FROM `items`  WHERE `items`.`auction_id` = 1  ORDER BY `items`.`seq` ASC
---
  def auction_items
    @auction = Auction.find(params[:id])
    @items = @auction.items.all.order(seq: :asc)

UPDATE `auctions` SET `logo_file_name` = 'DSC_4587.JPG', `logo_file_size` = 2052865, `logo_updated_at` = '2014-11-05 06:58:28', `updated_at` = '2014-11-05 06:58:33' WHERE `auctions`.`id` = 1
---
  def update
    respond_to do |format|
      if @auction.update(auction_params)

SELECT  `auctions`.* FROM `auctions`  WHERE `auctions`.`id` = 1 LIMIT 1
---
    def set_auction
      @auction = Auction.find(params[:id])