app/controllers/auctioneers_controller.rb

  def index
    if current_user.is_admin
      @auctioneers = Auctioneer.all
---
SELECT `auctioneers`.* FROM `auctioneers`