app/controllers/bids_controller.rb

  def index
    @bids = Bid.all
---
SELECT `bids`.* FROM `bids`

  def new
    @bid = Bid.new
    @item = Item.find(params[:item])
---
SELECT  `items`.* FROM `items`  WHERE `items`.`id` = 10 LIMIT 1

  def create
    @bid = Bid.new(bid_params)
    @bid.user_id = current_user.id
    if @bid.item.buyitnow
      @bid.amount = @bid.item.start_bid
      @bid.item.qty -= @bid.qty
    end
    if outbid_user = outbid
        UserMailer.outbid(@bid).deliver
      # mail message
    end
    respond_to do |format|
      if @bid.save
---
INSERT INTO `bids` (`amount`, `created_at`, `item_id`, `qty`, `updated_at`, `user_id`) VALUES (99.0, '2014-11-03 17:11:37', 1, 1, '2014-11-03 17:11:37', 1)