app/controllers/items_controller.rb

  def new
    @item = Item.new
    @auction = Auction.find(params[:auction])
---
SELECT  `auctions`.* FROM `auctions`  WHERE `auctions`.`id` = 1 LIMIT 1

  def edit
    @auction = Auction.find(params[:auction])
    @oldseq = Item.find(params[:id]).seq
---
SELECT  `auctions`.* FROM `auctions`  WHERE `auctions`.`id` = 1 LIMIT 1
SELECT  `items`.* FROM `items`  WHERE `items`.`id` = 10 LIMIT 1

  def update
    respond_to do |format|
      @list = @item.auction.items.all
      temp = Item.new(item_params)
      item = Item.find_by seq: @item.seq, id: @item.id #Item sequence was changed and collides
     # logger.info {">>>>>item   #{item.id} #{item.seq} temp #{temp.seq}  <<<<"}
      @list.each do |l|
     # logger.info {">>>>>   #{item.seq}  #{temp.seq}  <<<<"}
            if item.seq > temp.seq   # dir = up
              if ((l.seq < item.seq) && (l.seq >= temp.seq))
                  l.seq += 1
                  l.save
---
SELECT  `auctions`.* FROM `auctions`  WHERE `auctions`.`id` = 1 LIMIT 1
SELECT `items`.* FROM `items`  WHERE `items`.`auction_id` = 1
SELECT  `items`.* FROM `items`  WHERE `items`.`auction_id` = 1 AND `items`.`seq` = 5 LIMIT 1
UPDATE `items` SET `bid_increment` = 0.0, `seq` = 6, `updated_at` = '2014-11-03 14:12:55' WHERE `items`.`id` = 6

    def set_item
      @item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items`  WHERE `items`.`id` = 10 LIMIT 1