app/controllers/users_controller.rb

  def index
    if current_user.is_admin
      @users = User.all
---
SELECT `users`.* FROM `users`